Revit 2027 API
ParameterTypeId.ConnectorGenderType Property
 "Connector Gender Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ConnectorGenderType { get; }
Public Shared ReadOnly Property ConnectorGenderType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ConnectorGenderType {
	ForgeTypeId^ get ();
}
static member ConnectorGenderType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace